---
kind: type
id: T:Autodesk.Revit.DB.BeamSystem
source: html/6c5c1bd2-8456-5ec9-c53e-0bd3f604ad06.htm
---
# Autodesk.Revit.DB.BeamSystem

An object that represents a BeamSystem within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class BeamSystem : Element
```

## Remarks
This object is derived from the Element base object. It can be used to access properties
 of a BeamSystem, such as elevation, level, etc. It also provides access to the beams (FamilyInstances) that are created by this BeamSystem.